## Plan Result (Infrastructure)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_cosmosdb_sql_container.this[&#34;platopsapps&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_sql_container.this["platopsapps"] will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name          = "version-reporter-ptl-cosmos"
      + database_name         = "reports"
      + id                    = (known after apply)
      + name                  = "platopsapps"
      + partition_key_kind    = "Hash"
      + partition_key_path    = "/appName"
      + partition_key_paths   = (known after apply)
      + partition_key_version = 2
      + resource_group_name   = "cft-platform-version-reporter-ptl-rg"
      + throughput            = (known after apply)

      + autoscale_settings {
          + max_throughput = 4000
        }

      + conflict_resolution_policy (known after apply)

      + indexing_policy {
          + indexing_mode = "consistent"

          + included_path {
              + path = "/*"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":165,"Program":"tfcmt","SHA1":"","Target":"Infrastructure","Vars":{}} -->